# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

user_str = input("Введите строку из нескольких слов, разделенных пробелами: ")

# Пришлось вводить счетчик строки, чтобы пронумеровать. Знаю, что должно быть enumerate, но здесь не могу придумать, как его впихнуть.
# если нумеровать при объявлении цикла, создаются кортежи, у которых потом нельзя отрезать буквы после 10й
i=1
for z in user_str.split():
    print(f"{i}. {z[:10]}")
    i=i+1