#Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
#Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
#Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
#Например: a = 2, b = 3.
#Результат:
#1-й день: 2
#2-й день: 2,2
#3-й день: 2,42
#4-й день: 2,66
#5-й день: 2,93
#6-й день: 3,22
#Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.

a=float(input("Введите количество км в первый день: "))
b=float(input("Введите конечную цель в км: "))

#Проверяем условие задачи на корректность
while a>=b:
    print('Так не пойдет. Значение a должно быть меньше b')
    a = float(input("Введите количество км в первый день: "))
    b = float(input("Введите конечную цель в км: "))

#А теперь сама логика
day_count=1
while a<=b:
    a=a*1.1
    day_count=day_count+1
    if a>=b:
        break

print(f"Спортсмен пробежит {b}км на {day_count} день")