#Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
#Каждый кортеж хранит информацию об отдельном товаре.
#В кортеже должно быть два элемента — номер товара и словарь с параметрами(характеристиками товара: название, цена, количество, единица измерения).
#Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

my_list=[]
user_answer=1
while user_answer==1:
    prod_name=input('Введите название товара: ')
    prod_price=float(input('Введите цену товара: '))
    prod_count=int(input('Введите количество товара: '))
    prod_unit=input('Введите единицу измерения товара: ')
    my_dict={"название": prod_name, "цена": prod_price, "количество": prod_count, "единица измерения": prod_unit}
    my_list.append(my_dict)
    print(my_list)
    user_answer=int(input('Если хотите добавить еще товар, нажмите 1. Если нет, нажмите 0: '))

for z in enumerate(my_list, 1):
    print(z)
    
    
# Необходимо собрать аналитику о товарах. Реализовать словарь,
# в котором каждый ключ — характеристика товара, например название, а значение — список значений-характеристик, например список названий товаров.

name_list=[]
price_list=[]
count_list=[]
unit_list=[]

for k in my_list:
    name_list.append(k.get('название'))
    price_list.append(k.get('цена'))
    count_list.append(k.get('количество'))
    unit_list.append(k.get('единица измерения'))

final_dict={"название": name_list, "цена": price_list, "количество": count_list, "единица измерения": unit_list}
print ("В агрегированном виде это будет выглядеть так:")
print (final_dict)
