#3.Создать текстовый файл (не программно), построчно записать фамилии сотрудников и величину их окладов.
# Определить, кто из сотрудников имеет оклад менее 20 тыс., вывести фамилии этих сотрудников.
# Выполнить подсчет средней величины дохода сотрудников.

doc=open("text_3.txt","r", encoding="utf-8")
res=doc.readlines()
sum_salary=0
print("Меньше 20000 получают:")
for z in res:
    sum_salary=sum_salary+float(z.split()[1])
    if float(z.split()[1])<20000:
        print(z.split()[0])
print(f"Средняя величина дохода сотрудников: {sum_salary/len(res)}")
doc.close()