#Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
#Каждый кортеж хранит информацию об отдельном товаре.
#В кортеже должно быть два элемента — номер товара и словарь с параметрами(характеристиками товара: название, цена, количество, единица измерения).
#Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

my_list=[]
user_answer=1
while user_answer==1:
    prod_name=input('Введите название товара: ')
    prod_price=float(input('Введите цену товара: '))
    prod_count=int(input('Введите количество товара: '))
    prod_unit=input('Введите единицу измерения товара: ')
    my_dict={"название": prod_name, "цена": prod_price, "количество": prod_count, "единица измерения": prod_unit}
    my_list.append(my_dict)
    print(my_list)
    user_answer=int(input('Если хотите добавить еще товар, нажмите 1. Если нет, нажмите 0: '))

for z in enumerate(my_list, 1):
    print(z)