# Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же, но с прописной первой буквой.
# Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре.
# Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().

def int_func(word):
    """По условию задачи функция может принимать слово только маленькими латинскими буквами"""
    if word.islower() and word.



    first_lit=word[0].upper()
    another_lit=word[1:]
    result=first_lit+another_lit
    return result

# Сначала пользователь вводит слово. Все, что после пробела отрезаем, проверяем на латинские буквы
while True:
    user_word = input("Введите слово: ").lower()
    print(int_func(user_word))
