# 6. Реализовать два небольших скрипта:
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.

from itertools import cycle

my_list=["Ночь", "Улица", "Фонарь", "Аптека"]
c=1
for z in cycle(my_list):
    if c>20:
        break
    print(z)
    c+=1
