# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
new_list=[1, 5.2, 'Привет', False, ['123', 'Список в списке'],
          (1,4,2, "И кортеж добавим"), {"Множество","Множество",123,132,123},
          {"k1": "И еще словарь", "k2": 56, "k3": 6784}]

for z in new_list:
    print (z, type(z))



