#2. Создать текстовый файл (не программно), сохранить в нем несколько строк,
# выполнить подсчет количества строк, количества слов в каждой строке.

doc=open("Task1_2.txt","r", encoding="utf-8")
res=doc.readlines()
print(f"Количество строк в файле: {len(res)}")
i=1 #счетчик строк
for z in res:
    print(f"В {i} строке {len(z.split())} слов")
    i+=1
doc.close()