# Для списка реализовать обмен значений соседних элементов, т.е.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

new_list =(input("Введите побольше любых значений списка через пробел: ")).split()
print (new_list, type(new_list))

# Счетчик индексов
ind = 0
list_len=len(new_list)

#Добавляем условие, чтобы отсекать последнее значение, если их количество нечетное
if list_len%2!=0:
    list_len=list_len-1

#Логика здесь
for z in new_list:
   if ind>=list_len:
       break
   new_list[ind], new_list[ind+1] = new_list[ind+1], new_list[ind]
   ind = ind+2

print(new_list)