# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.

user_num=int(input("Введите число от 1 до 12: "))

while user_num<=0 or user_num>12:
    print ("Это число не попадает под условие")
    user_num=int(input("Введите число от 1 до 12: "))

new_dict={(1,2,12): "Зима",
           (3,4,5): "Весна",
           (6,7,8): "Лето",
           (9,10,11): "Осень"}

for z in new_dict.keys():
    if user_num in z:
        print(f"{user_num} месяц - это {new_dict.get(z)}")
        break

print('Работает!')